{
    "<PAD>": 0,
    "<UNK>": 1,
    "<SOS>": 2,
    "<EOS>": 3,
    "<SEP>": 4,
    "c": 5,
    "C": 6,
    "(": 7,
    ")": 8,
    "1": 9,
    "O": 10,
    "2": 11,
    "=": 12,
    "N": 13,
    "n": 14,
    "3": 15,
    "F": 16,
    "l": 17,
    "[O-]": 18,
    "-": 19,
    "B": 20,
    "S": 21,
    "r": 22,
    "4": 23,
    "#": 24,
    "[C@H]": 25,
    "[Na+]": 26,
    "[C@@H]": 27,
    "[K+]": 28,
    "/": 29,
    "P": 30,
    "[N+]": 31,
    "[nH]": 32,
    "s": 33,
    "o": 34,
    "[Pd]": 35,
    "[P]": 36,
    "[Cl]": 37,
    "I": 38,
    "[OH-]": 39,
    "[Si]": 40,
    "5": 41,
    "[Cl-]": 42,
    "[CH2]": 43,
    "[Cs+]": 44,
    "[H-]": 45,
    "[O]": 46,
    "[N-]": 47,
    "[Li+]": 48,
    "[P-]": 49,
    "[Li]": 50,
    "[NH4+]": 51,
    "[C@]": 52,
    "[c-]": 53,
    "[Pd+2]": 54,
    "[Cu]": 55,
    "\\": 56,
    "6": 57,
    "[C@@]": 58,
    "[c]": 59,
    "[B-]": 60,
    "[CH]": 61,
    "[I]": 62,
    "[Cu+2]": 63,
    "[P+]": 64,
    "[CH3]": 65,
    "[I-]": 66,
    "[C-]": 67,
    "[F-]": 68,
    "[Fe+2]": 69,
    "[C]": 70,
    "[Fe]": 71,
    "[Sn]": 72,
    "[Mg]": 73,
    "[Al+3]": 74,
    "[Br-]": 75,
    "[BH4-]": 76,
    "[Br]": 77,
    "[Pd+]": 78,
    "[n+]": 79,
    "[Ni]": 80,
    ">": 81,
    "<": 82,
    "[NH2]": 83,
    "[CH2-]": 84,
    "[H]": 85,
    "[O+]": 86,
    "[Na]": 87,
    "[Zn]": 88,
    "[Zn+2]": 89,
    "[Rh]": 90,
    "[Ir]": 91,
    "[Cu+]": 92,
    "[BH-]": 93,
    "[NH3+]": 94,
    "[Ir-]": 95,
    "[K]": 96,
    "[BH3-]": 97,
    "[Ti+4]": 98,
    "[O-2]": 99,
    "[Al+]": 100,
    "[SiH]": 101,
    "7": 102,
    "[F]": 103,
    "[Mg+2]": 104,
    "[OH2+]": 105,
    "[Ag+]": 106,
    "[n]": 107,
    "[Al]": 108,
    "[OH]": 109,
    "[S-]": 110,
    "[PH]": 111,
    "[Ca+2]": 112,
    "[nH+]": 113,
    "[Ru]": 114,
    "[Mn]": 115,
    "[Ti]": 116,
    "[AlH]": 117,
    "[S@]": 118,
    "[NH2+]": 119,
    "[PH+]": 120,
    "[S+]": 121,
    "[Zn+]": 122,
    "[cH-]": 123,
    "[NH+]": 124,
    "[SiH2]": 125,
    "[S@@]": 126,
    "[Pt]": 127,
    "[Cr]": 128,
    "[Ag]": 129,
    "[Cl+3]": 130,
    "[Mn+4]": 131,
    "[H+]": 132,
    "[Cl+]": 133,
    "[N]": 134,
    "[Yb+3]": 135,
    "[Mg+]": 136,
    "[PH2]": 137,
    "[Se]": 138,
    "[SnH]": 139,
    "[I+3]": 140,
    "[B]": 141,
    "8": 142,
    "[Co]": 143,
    "[Ir+3]": 144,
    "[Ba+2]": 145,
    "[o+]": 146,
    "[Mo]": 147,
    "[S]": 148,
    "[NH2-]": 149,
    "[Rh+]": 150,
    "[W]": 151,
    "[Zr+4]": 152,
    "[Co+2]": 153,
    "[Cu-]": 154,
    "[SiH3]": 155,
    "[NH-]": 156,
    "[Sn+2]": 157,
    "[S-2]": 158,
    "[se]": 159,
    "[Os]": 160,
    "[2H]": 161,
    "[Sb-]": 162,
    "[Ce+3]": 163,
    "[Ru+2]": 164,
    "[Ag+2]": 165,
    "[AlH2-]": 166,
    "[Rh+2]": 167,
    "[Cr+6]": 168,
    "[CH-]": 169,
    "[Hg]": 170,
    "[Ce+4]": 171,
    "[Bi]": 172,
    "[F+]": 173,
    "[As]": 174,
    "9": 175,
    "[SH]": 176,
    "[n-]": 177,
    "[Mn+2]": 178,
    "[Ce]": 179,
    "[Zr+2]": 180,
    "[*:2]": 181,
    "[*:1]": 182,
    "[Zr]": 183,
    "[Fe+3]": 184,
    "[Ag-]": 185,
    "[SH-]": 186,
    "[AlH4-]": 187,
    "[I+2]": 188,
    "[Pt-2]": 189,
    "[Pb+3]": 190,
    "[Sc+3]": 191,
    "[Ni+2]": 192,
    "[I+]": 193,
    "[Pd-]": 194,
    "p": 195,
    "[Ti+3]": 196,
    "[Pd-2]": 197,
    "[Sb]": 198,
    "[Hf+4]": 199,
    "[IH]": 200,
    "%": 201,
    "[Pr+3]": 202,
    "[Bi+3]": 203,
    "[Pb+4]": 204,
    "[PH3+]": 205,
    "[Sn+4]": 206,
    "[In+3]": 207,
    "[Sn+]": 208,
    "[Ca]": 209,
    "[V]": 210,
    "[CH3-]": 211,
    "[C+4]": 212,
    "[Br+2]": 213,
    "[Cr+3]": 214,
    "[La+3]": 215,
    "[Co+3]": 216,
    "[Al+2]": 217,
    "[P+5]": 218,
    "[Fe-3]": 219,
    "[Au]": 220,
    "[Ti+2]": 221,
    "[Pb+2]": 222,
    "[Pd-4]": 223,
    "[V+5]": 224,
    "[Ge]": 225,
    "[B+]": 226,
    "[BH2-]": 227,
    "[SnH3]": 228,
    "[PH4+]": 229,
    "[SH+]": 230,
    "[s+]": 231,
    "[P@]": 232,
    "[Ir+]": 233,
    "[SiH4]": 234,
    "[Ga+3]": 235,
    "[Cd+2]": 236,
    "[Cl+2]": 237,
    "[Al-]": 238,
    "[N@@]": 239,
    "[Hg+2]": 240,
    "[Dy+3]": 241,
    "[In]": 242,
    "[Eu+3]": 243,
    "[Nd+3]": 244,
    "0": 245,
    "[sH+]": 246,
    "[Mn+3]": 247,
    "[Sr+2]": 248,
    "[Er+3]": 249,
    "[Pb]": 250,
    "[Sn+3]": 251,
    "[Nd]": 252,
    "[AlH-]": 253,
    "[Rh+3]": 254,
    "[Nb+5]": 255,
    "[Pr]": 256,
    "[Si-]": 257,
    "[SeH]": 258,
    "[N@]": 259,
    "[Pt+2]": 260,
    "[IH+]": 261,
    "[Ga]": 262,
    "[Se-2]": 263,
    "[Ar]": 264,
    "[C+]": 265,
    "[Yb]": 266,
    "[P+3]": 267,
    "[La]": 268,
    "[Y+3]": 269,
    "[SnH4]": 270,
    "[Cr+2]": 271,
    "[Cs]": 272,
    "[PH3]": 273,
    "[Fe-4]": 274,
    "[Sm+3]": 275,
    "[Ba]": 276,
    "[Ni+3]": 277,
    "[Re]": 278,
    "[Hf]": 279,
    "[Pd-3]": 280,
    "[Si+4]": 281,
    "[Gd+3]": 282,
    "[Tl]": 283,
    "[Xe]": 284,
    "[Ru+]": 285,
    "[Rb+]": 286,
    "[Tl+]": 287,
    "[Ta]": 288,
    "[IH2+]": 289,
    "[B+3]": 290,
    "[Fe+6]": 291,
    "[Gd]": 292,
    "[pH]": 293,
    "[13CH4]": 294,
    "[CH2+]": 295,
    "[Sc]": 296,
    "[te]": 297,
    "[Sm]": 298,
    "[U+2]": 299,
    "[Sb+3]": 300,
    "[SH2]": 301,
    "[Te]": 302,
    "[SeH-]": 303,
    "[PH2+]": 304,
    "[Hf+2]": 305,
    "[Ta+5]": 306,
    "[Hg+]": 307,
    "[Sm+2]": 308,
    "[Au+]": 309,
    "[N@@+]": 310,
    "[U+4]": 311,
    "[Ru-4]": 312,
    "[Bi+]": 313,
    "[NH]": 314,
    "[Sb+2]": 315,
    "[Tl+3]": 316,
    "[SiH-]": 317,
    "[Rh+4]": 318,
    "[ClH+]": 319,
    "[Ru-]": 320,
    "[se+]": 321,
    "[AlH3]": 322,
    "[Eu]": 323,
    "[P@@]": 324,
    "[As+3]": 325,
    "[BiH3]": 326,
    "[SH3+]": 327,
    "[Sn+6]": 328,
    "b": 329,
    "[Au-]": 330,
    "[Ti+]": 331,
    "[Si@]": 332,
    "[AsH3]": 333,
    "[AsH]": 334,
    "[Si+]": 335,
    "[99Tc]": 336,
    "[TeH]": 337,
    "[TaH3]": 338,
    "[Br+]": 339,
    "[Zr+3]": 340,
    "[Ni-]": 341,
    "[SH2+]": 342,
    "[GeH]": 343,
    "[Rh-]": 344,
    "[Cr+4]": 345,
    "[Sb+5]": 346,
    "[Si@H]": 347,
    "[Sb+]": 348,
    "[Au+3]": 349,
    "[13c]": 350,
    "[He]": 351,
    "[PH5]": 352,
    "[V+4]": 353,
    "[Zr+]": 354,
    "[N@+]": 355,
    "[P+2]": 356,
    "[V+2]": 357,
    "[SnH2]": 358,
    "[Nb]": 359,
    "[3H]": 360,
    "[Fe+]": 361,
    "[Fe+4]": 362,
    "[Ru+3]": 363,
    "[Pd+4]": 364,
    "[Co+]": 365,
    "[OH+]": 366,
    "[Ir-4]": 367,
    "[Pt+4]": 368,
    "[BH]": 369,
    "[Y]": 370,
    "[PH2-]": 371,
    "[P-3]": 372,
    "[N@@H+]": 373,
    "[Pt-]": 374
}